#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/FlemingFriday-RobO/learn-terraform-github-actions/runs/run-RzgSZ59zJo4FjBHY

Waiting for the plan to start...

Terraform v1.10.4
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_autoscaling_attachment.salsaSunday_asg_attachment will be created
  + resource "aws_autoscaling_attachment" "salsaSunday_asg_attachment" {
      + alb_target_group_arn   = (known after apply)
      + autoscaling_group_name = (known after apply)
      + id                     = (known after apply)
    }

  # aws_autoscaling_group.salsaSunday-ASG-80 will be created
  + resource "aws_autoscaling_group" "salsaSunday-ASG-80" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = 4
      + enabled_metrics           = [
          + "GroupDesiredCapacity",
          + "GroupInServiceInstances",
          + "GroupMaxSize",
          + "GroupMinSize",
          + "GroupTotalInstances",
        ]
      + force_delete              = true
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = "ELB"
      + id                        = (known after apply)
      + max_size                  = 6
      + metrics_granularity       = "1Minute"
      + min_size                  = 2
      + name                      = (known after apply)
      + name_prefix               = "salsaSunday-auto-scaling-group-"
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + target_group_arns         = (known after apply)
      + vpc_zone_identifier       = (known after apply)
      + wait_for_capacity_timeout = "10m"

      + initial_lifecycle_hook {
          + default_result          = "CONTINUE"
          + heartbeat_timeout       = 300
          + lifecycle_transition    = "autoscaling:EC2_INSTANCE_TERMINATING"
          + name                    = "scale-in-protection"
            # (3 unchanged attributes hidden)
        }
      + initial_lifecycle_hook {
          + default_result          = "CONTINUE"
          + heartbeat_timeout       = 60
          + lifecycle_transition    = "autoscaling:EC2_INSTANCE_LAUNCHING"
          + name                    = "instance-protection-launch"
          + notification_metadata   = jsonencode(
                {
                  + key = "value"
                }
            )
            # (2 unchanged attributes hidden)
        }

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }

      + tag {
          + key                 = "Environment"
          + propagate_at_launch = true
          + value               = "Production"
        }
      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "salsaSunday-instance"
        }
    }

  # aws_autoscaling_notification.example_notifications will be created
  + resource "aws_autoscaling_notification" "example_notifications" {
      + group_names   = (known after apply)
      + id            = (known after apply)
      + notifications = [
          + "autoscaling:EC2_INSTANCE_LAUNCH",
          + "autoscaling:EC2_INSTANCE_LAUNCH_ERROR",
          + "autoscaling:EC2_INSTANCE_TERMINATE",
          + "autoscaling:EC2_INSTANCE_TERMINATE_ERROR",
        ]
      + topic_arn     = (known after apply)
    }

  # aws_autoscaling_policy.salsaSunday_scaling_policy will be created
  + resource "aws_autoscaling_policy" "salsaSunday_scaling_policy" {
      + arn                       = (known after apply)
      + autoscaling_group_name    = (known after apply)
      + estimated_instance_warmup = 120
      + id                        = (known after apply)
      + metric_aggregation_type   = (known after apply)
      + name                      = "salsaSunday-cpu-target"
      + policy_type               = "TargetTrackingScaling"

      + target_tracking_configuration {
          + disable_scale_in = false
          + target_value     = 75

          + predefined_metric_specification {
              + predefined_metric_type = "ASGAverageCPUUtilization"
            }
        }
    }

  # aws_eip.nat will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "nat"
        }
      + tags_all             = {
          + "Name" = "nat"
        }
      + vpc                  = true
    }

  # aws_instance.web will be created
  + resource "aws_instance" "web" {
      + ami                                  = "ami-004374a3d56f732a6"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags_all                             = (known after apply)
      + tenancy                              = (known after apply)
      + user_data                            = "336706a3536fb24ccad24c929726dc736cc9fc87"
      + user_data_base64                     = (known after apply)
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + root_block_device (known after apply)
    }

  # aws_internet_gateway.igw will be created
  + resource "aws_internet_gateway" "igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name"    = "salsaSunday_IG"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + tags_all = {
          + "Name"    = "salsaSunday_IG"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + vpc_id   = (known after apply)
    }

  # aws_launch_template.salsaSunday-LT-80 will be created
  + resource "aws_launch_template" "salsaSunday-LT-80" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + id                     = (known after apply)
      + image_id               = "ami-004374a3d56f732a6"
      + instance_type          = "t2.micro"
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "salsaSunday-LT-80"
      + tags_all               = (known after apply)
      + user_data              = "IyEvYmluL2Jhc2gKeXVtIHVwZGF0ZSAteQp5dW0gaW5zdGFsbCAteSBodHRwZApzeXN0ZW1jdGwgc3RhcnQgaHR0cGQKc3lzdGVtY3RsIGVuYWJsZSBodHRwZAoKIyBHZXQgdGhlIElNRFN2MiB0b2tlbgpUT0tFTj0kKGN1cmwgLVggUFVUICJodHRwOi8vMTY5LjI1NC4xNjkuMjU0L2xhdGVzdC9hcGkvdG9rZW4iIC1IICJYLWF3cy1lYzItbWV0YWRhdGEtdG9rZW4tdHRsLXNlY29uZHM6IDIxNjAwIikKCiMgQmFja2dyb3VuZCB0aGUgY3VybCByZXF1ZXN0cwpjdXJsIC1IICJYLWF3cy1lYzItbWV0YWRhdGEtdG9rZW46ICRUT0tFTiIgLXMgaHR0cDovLzE2OS4yNTQuMTY5LjI1NC9sYXRlc3QvbWV0YS1kYXRhL2xvY2FsLWlwdjQgJj4gL3RtcC9sb2NhbF9pcHY0ICYKY3VybCAtSCAiWC1hd3MtZWMyLW1ldGFkYXRhLXRva2VuOiAkVE9LRU4iIC1zIGh0dHA6Ly8xNjkuMjU0LjE2OS4yNTQvbGF0ZXN0L21ldGEtZGF0YS9wbGFjZW1lbnQvYXZhaWxhYmlsaXR5LXpvbmUgJj4gL3RtcC9heiAmCmN1cmwgLUggIlgtYXdzLWVjMi1tZXRhZGF0YS10b2tlbjogJFRPS0VOIiAtcyBodHRwOi8vMTY5LjI1NC4xNjkuMjU0L2xhdGVzdC9tZXRhLWRhdGEvbmV0d29yay9pbnRlcmZhY2VzL21hY3MvICY+IC90bXAvbWFjaWQgJgp3YWl0CgptYWNpZD0kKGNhdCAvdG1wL21hY2lkKQpsb2NhbF9pcHY0PSQoY2F0IC90bXAvbG9jYWxfaXB2NCkKYXo9JChjYXQgL3RtcC9heikKdnBjPSQoY3VybCAtSCAiWC1hd3MtZWMyLW1ldGFkYXRhLXRva2VuOiAkVE9LRU4iIC1zIGh0dHA6Ly8xNjkuMjU0LjE2OS4yNTQvbGF0ZXN0L21ldGEtZGF0YS9uZXR3b3JrL2ludGVyZmFjZXMvbWFjcy8kbWFjaWQvdnBjLWlkKQoKIyBDcmVhdGUgSFRNTCBmaWxlCmNhdCA8PC1IVE1MID4gL3Zhci93d3cvaHRtbC9pbmRleC5odG1sCjwhZG9jdHlwZSBodG1sPgo8aHRtbCBsYW5nPSJlbiIgY2xhc3M9ImgtMTAwIj4KPGhlYWQ+Cjx0aXRsZT5EZXRhaWxzIGZvciBwb3J0IDgwIEVDMiBpbnN0YW5jZTwvdGl0bGU+CjwvaGVhZD4KPGJvZHk+CjxkaXY+CjxoMT5Lb3JhLWxlc3MgVGhlbzwvaDE+CjxoMT5IZWFkaW5nIGRvd24gdGhlIG1vdW50YWluIGluIE5vcnRoIENhbGlmb3JuaWE8L2gxPgogICAgCjxkaXYgY2xhc3M9InRlbm9yLWdpZi1lbWJlZCIgZGF0YS1wb3N0aWQ9IjE4NTA3MzQzIiBkYXRhLXNoYXJlLW1ldGhvZD0iaG9zdCIgZGF0YS1hc3BlY3QtcmF0aW89IjAuNTI1IiBkYXRhLXdpZHRoPSI1MCUiPjxhIGhyZWY9Imh0dHBzOi8vdGVub3IuY29tL3ZpZXcvaW0tc29sYS1rb3JlYW4tbW90b3ItbW9kZWwtYXNpYW4tZ2lmLTE4NTA3MzQzIj5JbSBTb2xhIEtvcmVhbiBHSUY8L2E+ZnJvbSA8YSBocmVmPSJodHRwczovL3Rlbm9yLmNvbS9zZWFyY2gvaW0rc29sYS1naWZzIj5JbSBTb2xhIEdJRnM8L2E+PC9kaXY+IDxzY3JpcHQgdHlwZT0idGV4dC9qYXZhc2NyaXB0IiBhc3luYyBzcmM9Imh0dHBzOi8vdGVub3IuY29tL2VtYmVkLmpzIj48L3NjcmlwdD4KCjxwPjxiPkluc3RhbmNlIE5hbWU6PC9iPiAkKGhvc3RuYW1lIC1mKSA8L3A+CjxwPjxiPkluc3RhbmNlIFByaXZhdGUgSXAgQWRkcmVzczogPC9iPiAkbG9jYWxfaXB2NDwvcD4KPHA+PGI+QXZhaWxhYmlsaXR5IFpvbmU6IDwvYj4gJGF6PC9wPgo8cD48Yj5WaXJ0dWFsIFByaXZhdGUgQ2xvdWQgKFZQQyk6PC9iPiAkdnBjPC9wPgo8L2Rpdj4KPC9ib2R5Pgo8L2h0bWw+CkhUTUwKCiMgQ2xlYW4gdXAgdGhlIHRlbXAgZmlsZXMKcm0gLWYgL3RtcC9sb2NhbF9pcHY0IC90bXAvYXogL3RtcC9tYWNpZAo="
      + vpc_security_group_ids = (known after apply)

      + metadata_options (known after apply)

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Name"    = "salsaSunday-LT-80"
              + "Owner"   = "Chewbacca"
              + "Planet"  = "Mustafar"
              + "Service" = "application1"
            }
        }
    }

  # aws_lb.salsaSunday-LB01 will be created
  + resource "aws_lb" "salsaSunday-LB01" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + desync_mitigation_mode     = "defensive"
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + enable_waf_fail_open       = false
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = false
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "salsaSunday-load-balancer"
      + security_groups            = (known after apply)
      + subnets                    = (known after apply)
      + tags                       = {
          + "Name"    = "salsaSundayLoadBalancer"
          + "Owner"   = "User"
          + "Project" = "Web Service"
          + "Service" = "salsaSunday"
        }
      + tags_all                   = {
          + "Name"    = "salsaSundayLoadBalancer"
          + "Owner"   = "User"
          + "Project" = "Web Service"
          + "Service" = "salsaSunday"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping (known after apply)
    }

  # aws_lb_listener.http will be created
  + resource "aws_lb_listener" "http" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_target_group.salsaSunday-TG01-80 will be created
  + resource "aws_lb_target_group" "salsaSunday-TG01-80" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "salsaSunday-target-group"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name"    = "salsaSundayTargetGroup"
          + "Owner"   = "User"
          + "Project" = "Web Service"
          + "Service" = "salsaSunday"
        }
      + tags_all                           = {
          + "Name"    = "salsaSundayTargetGroup"
          + "Owner"   = "User"
          + "Project" = "Web Service"
          + "Service" = "salsaSunday"
        }
      + target_type                        = "instance"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 5
          + interval            = 30
          + matcher             = "200"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }

      + stickiness (known after apply)
    }

  # aws_nat_gateway.nat will be created
  + resource "aws_nat_gateway" "nat" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name" = "nat"
        }
      + tags_all             = {
          + "Name" = "nat"
        }
    }

  # aws_route_table.private will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + nat_gateway_id             = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Name" = "private"
        }
      + tags_all         = {
          + "Name" = "private"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Name" = "public"
        }
      + tags_all         = {
          + "Name" = "public"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.private-us-west-1a will be created
  + resource "aws_route_table_association" "private-us-west-1a" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private-us-west-1c will be created
  + resource "aws_route_table_association" "private-us-west-1c" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public-us-west-1a will be created
  + resource "aws_route_table_association" "public-us-west-1a" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public-us-west-1c will be created
  + resource "aws_route_table_association" "public-us-west-1c" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_security_group.salsaSunday-LB01-SG01 will be created
  + resource "aws_security_group" "salsaSunday-LB01-SG01" {
      + arn                    = (known after apply)
      + description            = "salsaSunday-LB01-SG01"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "MyHomePage"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "salsaSunday-LB01-SG01"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"    = "salsaSunday-LB01-SG01"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + tags_all               = {
          + "Name"    = "salsaSunday-LB01-SG01"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.salsaSunday-TG01-SG01-80 will be created
  + resource "aws_security_group" "salsaSunday-TG01-SG01-80" {
      + arn                    = (known after apply)
      + description            = "salsaSunday-TG01-SG01-80"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "MyHomePage"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "SSH"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "salsaSunday-TG01-SG01-80"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"    = "salsaSunday-TG01-SG01-80"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + tags_all               = {
          + "Name"    = "salsaSunday-TG01-SG01-80"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.web-sg will be created
  + resource "aws_security_group" "web-sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8080
                # (1 unchanged attribute hidden)
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

  # aws_sns_topic.hello will be created
  + resource "aws_sns_topic" "hello" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "the0-knows"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + tags_all                    = (known after apply)
    }

  # aws_sns_topic_subscription.find_me will be created
  + resource "aws_sns_topic_subscription" "find_me" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "theogym3773@gmail.com"
      + endpoint_auto_confirms          = false
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # aws_subnet.private-us-west-1a will be created
  + resource "aws_subnet" "private-us-west-1a" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.32.11.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "private-us-west-1a"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + tags_all                                       = {
          + "Name"    = "private-us-west-1a"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private-us-west-1c will be created
  + resource "aws_subnet" "private-us-west-1c" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.32.13.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "private-us-west-1c"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + tags_all                                       = {
          + "Name"    = "private-us-west-1c"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public-us-west-1a will be created
  + resource "aws_subnet" "public-us-west-1a" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.32.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "public-us-west-1a"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + tags_all                                       = {
          + "Name"    = "public-us-west-1a"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public-us-west-1c will be created
  + resource "aws_subnet" "public-us-west-1c" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.32.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "public-us-west-1c"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + tags_all                                       = {
          + "Name"    = "public-us-west-1c"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.salsaSunday will be created
  + resource "aws_vpc" "salsaSunday" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.32.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"    = "salsaSunday"
          + "Owner"   = "Chewbacca"
          + "Planet"  = "Mustafar"
          + "Service" = "application1"
        }
      + tags_all                             = {
          + "Name"    = "salsaSunday"
          + "Owner"   = "Chewbacca"
          + "Planet"  = "Mustafar"
          + "Service" = "application1"
        }
    }

  # aws_wafv2_ip_set.ip_block_list will be created
  + resource "aws_wafv2_ip_set" "ip_block_list" {
      + addresses          = [
          + "1.188.0.0/16",
          + "1.80.0.0/16",
          + "101.144.0.0/16",
          + "101.16.0.0/16",
        ]
      + arn                = (known after apply)
      + description        = "List of blocked IP addresses"
      + id                 = (known after apply)
      + ip_address_version = "IPV4"
      + lock_token         = (known after apply)
      + name               = "ip-block-list"
      + scope              = "REGIONAL"
      + tags               = {
          + "Name"    = "ip-block-list"
          + "Owner"   = "Chewbacca"
          + "Planet"  = "Mustafar"
          + "Service" = "application1"
        }
      + tags_all           = {
          + "Name"    = "ip-block-list"
          + "Owner"   = "Chewbacca"
          + "Planet"  = "Mustafar"
          + "Service" = "application1"
        }
    }

  # aws_wafv2_web_acl.salsaSunday_waf_acl will be created
  + resource "aws_wafv2_web_acl" "salsaSunday_waf_acl" {
      + arn         = (known after apply)
      + capacity    = (known after apply)
      + description = "Web ACL for salsaSunday"
      + id          = (known after apply)
      + lock_token  = (known after apply)
      + name        = "salsaSunday-web-acl"
      + scope       = "REGIONAL"
      + tags        = {
          + "Name"    = "salsaSunday-web-acl"
          + "Owner"   = "Chewbacca"
          + "Planet"  = "Mustafar"
          + "Service" = "application1"
        }
      + tags_all    = {
          + "Name"    = "salsaSunday-web-acl"
          + "Owner"   = "Chewbacca"
          + "Planet"  = "Mustafar"
          + "Service" = "application1"
        }

      + default_action {
          + allow {
            }
        }

      + rule {
          + name     = "IPBlockRule"
          + priority = 1

          + action {
              + block {
                }
            }

          + statement {
              + ip_set_reference_statement {
                  + arn = (known after apply)
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = false
              + metric_name                = "IPBlockRule"
              + sampled_requests_enabled   = false
            }
        }
      + rule {
          + name     = "AWSManagedRulesAmazonIpReputationList"
          + priority = 3

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesAmazonIpReputationList"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = false
              + metric_name                = "AWSManagedRulesAmazonIpReputationList"
              + sampled_requests_enabled   = false
            }
        }
      + rule {
          + name     = "AWSManagedRulesAnonymousIpList"
          + priority = 4

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesAnonymousIpList"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = false
              + metric_name                = "AWSManagedRulesAnonymousIpList"
              + sampled_requests_enabled   = false
            }
        }
      + rule {
          + name     = "AWSManagedRulesCommonRuleSet"
          + priority = 2

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesCommonRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = false
              + metric_name                = "AWSManagedRulesCommonRuleSet"
              + sampled_requests_enabled   = false
            }
        }
      + rule {
          + name     = "AWSManagedRulesKnownBadInputs"
          + priority = 5

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesKnownBadInputsRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = false
              + metric_name                = "AWSManagedRulesKnownBadInputs"
              + sampled_requests_enabled   = false
            }
        }
      + rule {
          + name     = "AWSManagedRulesLinuxRuleSet"
          + priority = 6

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesLinuxRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = false
              + metric_name                = "AWSManagedRulesLinuxRuleSet"
              + sampled_requests_enabled   = false
            }
        }

      + visibility_config {
          + cloudwatch_metrics_enabled = false
          + metric_name                = "salsaSundayWebACL"
          + sampled_requests_enabled   = false
        }
    }

  # aws_wafv2_web_acl_association.salsaSunday_waf_alb_association will be created
  + resource "aws_wafv2_web_acl_association" "salsaSunday_waf_alb_association" {
      + id           = (known after apply)
      + resource_arn = (known after apply)
      + web_acl_arn  = (known after apply)
    }

  # random_pet.sg will be created
  + resource "random_pet" "sg" {
      + id        = (known after apply)
      + length    = 2
      + separator = "-"
    }

Plan: 32 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + lb_dns_name = (known after apply)
  + web-address = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @rofoed01, Action: `pull_request`*